In [137]:
from sqlalchemy import create_engine
import mysql.connector
import pymysql

#variabili per connessione
u = 'root'
p = 'giuschil91'
h = 'localhost'
d = 'ecommerce'

In [184]:
"""DELIMITER //
CREATE PROCEDURE inserter_marca()
BEGIN
	DECLARE app_img INT;
	DECLARE param_img INT;
	SET app_img = 0;
	SET param_img = 10;
	WHILE app_img < param_img DO
		SET app_img = app_img + 1;
		INSERT INTO `marca`(`mid`, `nome`,`immagine`,`url`)
		VALUES (CONCAT("10", app_img), CONCAT("marca_", app_img),CONCAT("titolo_immagine_", app_img), CONCAT("home/DB_ecommerce/img_", app_img) );
	END WHILE;
END; //
DELIMITER ;

call inserter_marca();
"""
"""
DROP PROCEDURE IF EXISTS insert_categoria;
DELIMITER //
CREATE PROCEDURE insert_categoria()
BEGIN
	DECLARE index_start INT;
	DECLARE index_end INT;
	SET index_start = 1;
	SET index_end = 200;
	WHILE index_start < index_end DO
		SET index_start = index_start + 1;
		INSERT INTO `categoria` (`nome`) VALUES (CONCAT("categoria_", index_start));
	END WHILE;
END; //
DELIMITER ;



call insert_categoria()
"""

'\nDROP PROCEDURE IF EXISTS insert_categoria;\nDELIMITER //\nCREATE PROCEDURE insert_categoria()\nBEGIN\n\tDECLARE index_start INT;\n\tDECLARE index_end INT;\n\tSET index_start = 1;\n\tSET index_end = 200;\n\tWHILE index_start < index_end DO\n\t\tSET index_start = index_start + 1;\n\t\tINSERT INTO `categoria` (`nome`) VALUES (CONCAT("categoria_", index_start));\n\tEND WHILE;\nEND; //\nDELIMITER ;\n\n\n\ncall insert_categoria()\n'

In [138]:
#funzione connection to mysql with python

def connection(user,password,host,db):
    '''
    user = name of user
    password = user pass
    host = host name
    db = database name
    '''
    try: 
        #try connection
        conn = mysql.connector.connect(user = u, password =p,host=h,database=d)
        #if connection is True print connection done
        print("connection done")
    except:
        print("connection error")
    return conn

In [180]:

def return_cursor(u,p,h,d):
    """
    user,password,host,database and return cursor
    """
    conn = mysql.connector.connect(user = u, password =p,host=h,database=d)
    cursor = conn.cursor()
    return cursor

def select_frm(name_column1,name_column2,table_name):
    """
    create a basic query with name_column 1 and 2 and table return query string
    """
    name_column = str(name_column1)
    name_column2 = str(name_column2)
    query = 'select ' + name_column1 +' , '+name_column2 + ' from ' + table_name + ';'
    return query

#metodo join
def join(table,column,table2,column2):
    """
    create a part of query join take table and column return join  query string
    """
    result ="%s.%s = %s.%s" % (table,column,table2,column2)
    return result

#metodo execute query
def execute_query(cursor, query):
    """
    cursor : cursor
    query : sql query
    return : execute cursor ->query
    """
    return cursor.execute(query)

def print_result(cursor):
    """
    cursor: cursor
    print -> fetchall with all data result of the query
    """
    for i in cursor.fetchall():
        print(i)

def insert_product(id,product_name,product_description):
    id = str(id)
    product_name = str(product_name)
    product_description = str(product_description)
    val = (id,product_name,product_description)
    sql = "INSERT INTO prodotti_amazon (id,Nome_prodotto,descrizione_prodotto) VALUES (%s, %s, %s)"
    cursor.execute(sql, val)

def delete_product(table,prodotto):
    #table = str(table)
    #nome_prodotto = str(nome_prodotto)
    #sql = "DELETE FROM %s WHERE Nome_prodotto = %s"
    sql = "Delete from " + str(table) + " where " + "Nome_prodotto = " + str(prodotto) + ";"
    print(sql)
    cursor.execute(sql)

In [181]:
#Connect to database
conn = mysql.connector.connect(user = u, password =p,host=h,database=d)

#create cursor
cursor = conn.cursor()
#execute query
cursor.execute(sql)
#result of the query 
result = cursor.fetchall()

In [156]:
########################################################################################
# QUERY NUMERO 1 Gli utenti iscritti alla newsletter che hanno fatto almeno 1 acquisto #
########################################################################################

sql = 'select distinct u.nome,u.cognome from utente u, ordine o where u.uid = o.uid and newsletter = 1;'

cursor.execute(sql)
result = cursor.fetchall()
print_query(result)

('Daniele', 'Pasquini')
('Silvia', 'Naro')
('Stefano', 'Di Vito')
('Angeni', 'Uminga')
('Giandomeni-co', 'Gangemi')
('Fran-co', 'Ventura')
('Alessandro', 'Biasi')
('Federi-ca', 'Lanucara')
('Edmondo', 'Pera')
('Azzurra', 'Pera')

In [157]:
#########################################################################
# QUERY NUMERO 2 sql ordini fatti da clienti registrati alla newsletter #
#########################################################################

sql = "select o.oid from ordine o, utente u where u.uid = o.uid and newsletter = 1"
cursor.execute(sql)
result = cursor.fetchall()
print_query(result)

(1,)
(21,)
(25,)
(5,)
(24,)
(6,)
(7,)
(8,)
(11,)
(15,)
(16,)
(22,)
(9,)
(18,)
(4,)
(10,)
(20,)
(14,)
(17,)
(12,)
(13,)

In [158]:
#########################################################################
# QUERY NUMERO 3 ordini fatti da clienti non registrati alla newsletter #
#########################################################################

sql = "select u.uid, u.nome from ordine o, utente u where u.uid = o.uid and newsletter = 0"

cursor.execute(sql)
result = cursor.fetchall()
print_query(result)

(20, 'John')
(20, 'John')
(20, 'John')
(20, 'John')

In [159]:
##############################################################
# QUERY NUMERO 4 sql cittÃ  con il maggior numero di ordini   #
##############################################################

sql ="select distinct i.citta, count(o.uid) as NumeroOrdini from ordine o, indirizzo i where i.uid = o.uid group by i.citta"

cursor.execute(sql)
result = cursor.fetchall()
print_query(result)

('Roma', 24)
('Gallico Superio-re', 1)
('Milano', 4)
('Assago', 2)
('Frascati', 1)
('Cosenza', 2)

In [160]:
#########################################################################################################
#QUERY NUMERO 5 sql Gli ordini con almeno 4 prodotti ordinati per valore del carrello decrescente       #
#########################################################################################################


sql = "SELECT op.quantita, op.prezzo FROM prodotto AS p INNER JOIN orpr01 AS op ON (p.pid = op.pid) INNER JOIN ordine AS o ON (op.oid = o.oid) WHERE op.quantita >4 Group by op.quantita,op.prezzo order by op.prezzo desc"
cursor.execute(sql)
result = cursor.fetchall()
print_query(result)

(6, 97.76)
(6, 50.35)
(6, 39.9)
(5, 39.9)
(6, 29.36)
(6, 23.66)
(5, 20.81)
(6, 15.52)
(5, 0.19)

In [161]:
#########################################################################################################
#QUERY NUMERO 6 sql codice utente, nome e valore carrello dell' utente che ha fatto ordine piu' costoso #
#########################################################################################################

sql = "select u.uid,u.nome, op.prezzo from utente as u, ordine as o, orpr01 as op where u.uid = o.uid and o.oid = op.oid order by op.prezzo desc"
cursor.execute(sql)
result = cursor.fetchall()
print_query(result)

(12, 'Alessandro', 461.61)
(14, 'Federi-ca', 209.0)
(1, 'Daniele', 204.0)
(3, 'Stefano', 162.0)
(3, 'Stefano', 139.9)
(4, 'Angeni', 139.0)
(20, 'John', 97.76)
(4, 'Angeni', 87.0)
(4, 'Angeni', 78.0)
(20, 'John', 71.25)
(3, 'Stefano', 59.0)
(4, 'Angeni', 55.0)
(4, 'Angeni', 51.0)
(20, 'John', 50.35)
(14, 'Federi-ca', 49.0)
(4, 'Angeni', 49.0)
(17, 'Azzurra', 45.0)
(3, 'Stefano', 44.0)
(14, 'Federi-ca', 43.0)
(20, 'John', 42.75)
(2, 'Silvia', 42.0)
(20, 'John', 39.9)
(12, 'Alessandro', 39.9)
(4, 'Angeni', 39.9)
(8, 'Giandomeni-co', 39.0)
(1, 'Daniele', 38.9)
(20, 'John', 37.05)
(12, 'Alessandro', 36.96)
(9, 'Fran-co', 36.0)
(4, 'Angeni', 35.0)
(16, 'Edmondo', 32.9)
(1, 'Daniele', 32.5)
(2, 'Silvia', 32.5)
(1, 'Daniele', 32.5)
(1, 'Daniele', 29.9)
(1, 'Daniele', 29.9)
(20, 'John', 29.36)
(1, 'Daniele', 24.0)
(2, 'Silvia', 23.9)
(20, 'John', 23.66)
(20, 'John', 23.66)
(20, 'John', 23.66)
(16, 'Edmondo', 23.0)
(2, 'Silvia', 22.0)
(3, 'Stefano', 21.9)
(20, 'John', 20.81)
(16, 'Edmondo', 18.9)
(2, 'Silvia', 18.0)
(20, 'John', 15.52)
(3, 'Stefano', 15.0)
(1, 'Daniele', 13.9)
(16, 'Edmondo', 13.5)
(17, 'Azzurra', 13.0)
(1, 'Daniele', 13.0)
(4, 'Angeni', 8.9)
(1, 'Daniele', 7.9)
(17, 'Azzurra', 7.5)
(12, 'Alessandro', 4.75)
(1, 'Daniele', 4.2)
(2, 'Silvia', 3.9)
(1, 'Daniele', 0.19)
(1, 'Daniele', 0.19)

In [162]:
#########################################################################################################
#QUERY NUMERO 7 sql utente che ha fatto il maggior numero di ordini
#########################################################################################################

sql = "select u.nome, count(op.oid) from utente as u, ordine as o, orpr01 as op where u.uid = o.uid and o.oid = op.oid and u.newsletter = 1 group by u.nome"
cursor.execute(sql)
result = cursor.fetchall()
print_query(result)

('Daniele', 13)
('Silvia', 6)
('Stefano', 6)
('Angeni', 9)
('Giandomeni-co', 1)
('Fran-co', 1)
('Alessandro', 4)
('Federi-ca', 3)
('Edmondo', 4)
('Azzurra', 3)

In [172]:
#########################################################################################################
#QUERY NUMERO 8 metodo di spedizione preferita
#########################################################################################################

sql = "select s.nome as modalita_spedizione, COUNT(s.nome) as quantita from spedizione s, pasp01 p, ordine o where s.spid = p.spid and p.paspid = o.paspid group by modalita_spedizione order by quantita desc;"
cursor.execute(sql)
result = cursor.fetchall()
print_query(result)

('Consegna con corriere GLS', 14)
('Spedizione in posta', 11)

In [177]:
#########################################################################################################
#QUERY NUMERO 9 metodo di pagamento preferito 
#########################################################################################################
sql = "select p.nome, COUNT(p.nome) from pagamento p, pasp01 pas, ordine o where p.paid = pas.paid and  pas.paspid = o.paspid group by p.nome;"


cursor.execute(sql)
result = cursor.fetchall()
print_query(result)

('Contrassegno', 15)
('Pagamento con Carta di Credito', 10)

In [168]:
#########################################################################################################
#QUERY NUMERO 10 numero ordini da rivenditori e da non rivenditori
#########################################################################################################

sql = "select s.nome as modalita_spedizione, COUNT(s.nome) as quantita from spedizione s, pasp01 p, ordine o where s.spid = p.spid and p.paspid = o.paspid group by modalita_spedizione order by quantita desc;"
cursor.execute(sql)
result = cursor.fetchall()
print_query(result)

('rivenditori', 16)

In [182]:
#chiusura connessione
conn.close()